import { CasesPost } from '@/components/cases/interfaces';

const casesData: CasesPost[] = [
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },

  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
  {
    id: 'polyinvest',
    title: 'Полиинвест',
    tags: ['лендинг', 'ux/ui дизайн', 'разработка', 'бот'],
    description:
      'Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки. Мы очень сильно заебались делать сайт для Антона Полякова, но в итоге все получилось. Мы молодцы, обращайтесь к нам, пожалуйста, так как нам очень нужны денежки',
    preview: '/assets/images/cases/polyinvest/preview.jpg',
    link: 'https://antonpolyakov.ru/',
    content: <>polyinvest content</>,
  },
];

export default casesData;
